In [5]:
# === Notebook Setup ===
# 1. Run the setup script to define helper functions and register magic
%run -i ../../../src/notebook_setup.py

# 2. Specify the database for THIS problem
problem_db_name = "leetcode_01_db"  # Database for LeetCode Patients/Diabetes problem

# 3. Create the engine for this problem's database
#    The 'db_engine' variable is used by the %%mysql_lab magic
db_engine = get_db_engine(problem_db_name)

# 4. Check if engine was created successfully before proceeding
if db_engine:
    print(f"\nSetup complete. Using database: {problem_db_name}")
else:
    print(f"\nERROR: Failed to create engine for {problem_db_name}. Cannot proceed.")

Running notebook setup script (v2: with get_db_engine)...
Registering custom MySQLLabMagic class...
Custom '%%mysql_lab' magic registered successfully.
Notebook setup script complete. Use 'get_db_engine(db_name)' to create engines.
Creating new engine for database 'leetcode_01_db'...
Successfully created and connected engine for 'leetcode_01_db'.

Setup complete. Using database: leetcode_01_db

## Problem: Patients With a Condition (Diabetes Type I - LeetCode)

We have a `patients` table in the `leetcode_01_db` database with the following structure:

* `patient_id` (INT)
* `patient_name` (VARCHAR)
* `conditions` (VARCHAR) - Contains space-separated condition codes.

Let's look at the data first.

In [6]:
%%mysql_lab
-- Display the contents of the patients table
SELECT * FROM patients;

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice          None
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

**Task:**

Write a SQL query to find the `patient_id`, `patient_name` and `conditions` of patients who have Type I Diabetes. Type I Diabetes always starts with `DIAB1` prefix **as a distinct word** (e.g., 'DIAB100' or 'XYZ DIAB150' but not 'ADIAB100').

**Expected Output:**

| patient\_id | patient\_name | conditions   |
| :---------- | :------------ | :----------- |
| 3           | Bob           | DIAB100 MYOP |
| 4           | George        | ACNE DIAB100 |

*(Explanation: Bob and George both have a condition that starts with DIAB1 as a word).*

In [7]:
%%mysql_lab
-- Write your SQL query here
-- Solution using REGEXP with word boundary:
SELECT
    patient_id,
    patient_name,
    conditions
FROM patients
WHERE conditions REGEXP '\\bDIAB1'; -- \\b matches word boundary

   patient_id patient_name    conditions
0           3          Bob  DIAB100 MYOP
1           4       George  ACNE DIAB100

In [8]:
%%mysql_lab
SELECT
    patient_id,
    patient_name,
    conditions
FROM patients
WHERE conditions LIKE 'DIAB1%%' OR conditions LIKE '%% DIAB1%%';

   patient_id patient_name    conditions
0           3          Bob  DIAB100 MYOP
1           4       George  ACNE DIAB100